# Core tools
brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'vim'
brew 'tree'
brew 'stow'
brew 'asdf'
brew 'magic-wormhole'
brew 'mosh'
brew 'jq'
brew 'coreutils'

# Casks
cask 'firefox'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'docker'
cask 'obsidian'

# Database tools
cask 'beekeeper-studio'
cask 'dbeaver-community'
brew 'duckdb'
brew 'sqlite'

# K8s tools
brew 'k9s'
brew 'kubectx'
brew 'kubernetes-cli'

# Innernet
tap 'tonarino/innernet'
brew 'innernet'

# Work
# tap 'dopplerhq/cli'
# brew 'doppler'
# brew 'awscli'
