# Taps
tap "tonarino/innernet"
# tap "dopplerhq/cli"

# Core tools
brew "asdf"
# brew "awscli"
brew "bash"
brew "bash-completion"
brew "coreutils"
# brew "doppler"
brew "duckdb"
brew "git"
brew "innernet"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "magic-wormhole"
brew "mosh"
brew "tree"
brew "sqlite"
brew "stow"
brew "vim"

# Casks
cask "beekeeper-studio"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "obsidian"
cask "visual-studio-code"


