# Taps
# tap "dopplerhq/cli"
# tap "minio/stable"
tap "paul-schwendenman/magic-log-ui"
# tap "stork-search/stork-tap"
# tap "stripe/stripe-cli"
# tap "supabase/tap"
tap "tonarino/innernet"

# Core tools
# brew "openssl@3"
# brew "xz"
# brew "ansible"
brew "asdf"
# brew "mpdecimal"
# brew "python@3.13"
# brew "awscli"
brew "bash"
brew "bash-completion"
# brew "bash-completion@2", link: false
# brew "bats-core"
# brew "cbonsai"
# brew "cmatrix"
# brew "colordiff"
brew "coreutils"
brew "docker-compose"
# brew "docker-machine"
brew "duckdb"
# brew "exercism"
brew "git"
# brew "gnupg"
# brew "handbrake", link: false
# brew "helm"
# brew "icu4c@76"
# brew "ios-sim"
# brew "joe"
brew "jq"
brew "k9s"
brew "kubectx"
brew "magic-wormhole"
brew "mosh"
# brew "mtr"
# brew "nmap"
# brew "pass"
# brew "pipenv"
brew "pass"
# brew "pkgconf"
brew "sqlite"
brew "step"
brew "stow"
brew "tree"
# brew "tcl-tk"
# brew "telnet"
brew "vim"
brew "wireguard-tools"
brew "yq"
brew "zlib"

# From Taps
brew "dopplerhq/cli/doppler", link: false
# brew "minio/stable/mc"
brew "paul-schwendenman/magic-log-ui/magic-log"
# brew "stork-search/stork-tap/stork"
# brew "stripe/stripe-cli/stripe"
# brew "supabase/tap/supabase"
brew "tonarino/innernet/innernet"

# Casks
# cask "balenaetcher"
cask "beekeeper-studio"
# cask "bluesnooze"
# cask "cursor"
cask "dbeaver-community"
# cask "discord"
cask "docker"
cask "firefox"
# cask "gimp"
cask "google-chrome"
cask "handbrake"
# cask "keepingyouawake"
# cask "mullvadvpn"
# cask "notunes"
# cask "obs"
cask "obsidian"
# cask "postman"
cask "slack"
cask "visual-studio-code"
# cask "vlc"

# VSCode extensions
vscode "bradlc.vscode-tailwindcss"
vscode "docker.docker"
# vscode "eamodio.gitlens"
# vscode "ecmel.vscode-html-css"
# vscode "esbenp.prettier-vscode"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
# vscode "inlang.vs-code-extension"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
# vscode "lextudio.restructuredtext"
# vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
# vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode.makefile-tools"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vsliveshare.vsliveshare"
# vscode "mtxr.sqltools"
# vscode "prisma.prisma"
# vscode "redhat.vscode-yaml"
# vscode "rubberduck.rubberduck-vscode"
# vscode "streetsidesoftware.code-spell-checker"
# vscode "supabase.postgrestools"
vscode "svelte.svelte-vscode"
# vscode "swyddfa.esbonio"
# vscode "tomoki1207.pdf"
# vscode "trond-snekvik.simple-rst"
# vscode "vitest.explorer"
vscode "vscodevim.vim"
